Revit 2017 API
Rebar.Pitch Property
 For a spiral, the pitch, or vertical distance traveled in one rotation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2009
Syntax
C#
public double Pitch { get; set; }
Visual Basic
Public Property Pitch As Double
	Get
	Set
Visual C++
public:
property double Pitch {
	double get ();
	void set (double value);
}
Remarks
 Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: pitch must be positive.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This Rebar is not an instance of a spiral shape.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace